Output from `terraform plan`
```
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-profile"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-prisoner-profile-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-prisoner-profile-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["questionnaire"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-questionnaire-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:3HIVPY6YERAVFEKQIKVU7SPHME"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "questionnaire"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "questionnaire"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "questionnaire"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "questionnaire"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "questionnaire"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-questionnaire-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-questionnaire-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-questionnaire-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-questionnaire-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "questionnaire"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "questionnaire"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["reference"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:HSJL5DEU6ZD6XGM6J6QUZP6IMY"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "reference"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-reference-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-reference-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["safety"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-safety-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:TH4MQPYA2RBYTISHBPMQDN6B6E"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "safety"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "safety"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "safety"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "safety"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "safety"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-safety-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-safety-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-safety-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-safety-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "safety"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "safety"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["sentence"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:FB26P2RSERAGXBSG4OKMSUUHE4"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "sentence"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-sentence-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-sentence-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["transactions"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-transactions-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:FQX6K2HZTJFYTHJJ7TXESPWOX4"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "transactions"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "transactions"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-transactions-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-transactions-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-transactions-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-transactions-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "transactions"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "transactions"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.maintenance-pipeline["visits"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:2TXGEFCWXNBLJK6VFXPZGTNHRM"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "visits"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-visits-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-nomis-visits-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ extra_connection_attributes = (sensitive value)
        id                          = "dpr-dms-nomis-oracle-source-endpoint"
      ~ password                    = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ port                        = (sensitive value)
        tags                        = {
            "DMS_Source"     = "nomis"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 52 to add, 166 to change, 0 to destroy.

```